tests/western_union/endpoints/send_money.yaml

responses:
- response:
    auto_calculate_content_length: false
    body: '<?xml version="1.0" encoding="UTF-8"?>

      <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
      xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><soapenv:Body><xrsi:send-money-validation-reply
      xmlns:xrsi="http://www.westernunion.com/schema/xrsi"><channel><version>9500</version></channel><instant_notification><addl_service_charges>010300002010030100103MSG02010030101103FEE1204300013043000961501010020100301099200101C0211UDI0000009299210417wufxspd0002046230                                                                                                                                                                               </addl_service_charges></instant_notification><sender><name
      name_type="C"><business_name>UNICEF</business_name></name><address><addr_line1>3
      United Nations Plaza</addr_line1><addr_line2/><city>NEW YORK</city><state>NY</state><postal_code>10017</postal_code><country_code><iso_code><country_code>US</country_code><currency_code>USD</currency_code></iso_code><country_name>US</country_name></country_code><local_area>NEW
      YORK</local_area><street>3 United Nations Plaza</street></address><preferred_customer/><email>unicef@unicef.org</email><contact_phone>2123267000</contact_phone><mobile_phone><phone_number><country_code>1</country_code><national_number>2123267000</national_number></phone_number></mobile_phone></sender><receiver><name
      name_type="D"><first_name>Aliyah</first_name><last_name>GRAY</last_name></name><address><country_code><iso_code><country_code>ES</country_code><currency_code>EUR</currency_code></iso_code></country_code><address_type>I</address_type></address><email>john@smith.com</email><mobile_phone><phone_number/></mobile_phone></receiver><payment_details><expected_payout_location/><recording_country_currency><iso_code><country_code>US</country_code><currency_code>USD</currency_code></iso_code></recording_country_currency><destination_country_currency><iso_code><country_code>ES</country_code><currency_code>EUR</currency_code></iso_code></destination_country_currency><originating_country_currency><iso_code><country_code>US</country_code><currency_code>USD</currency_code></iso_code></originating_country_currency><originating_city>NEW
      YORK</originating_city><originating_state>NE</originating_state><transaction_type>WMF</transaction_type><payment_type>Cash</payment_type><exchange_rate>0.7856</exchange_rate><fix_on_send>Y</fix_on_send><credit_debit_card_details><authorization_code/></credit_debit_card_details><duplicate_detection_flag>D</duplicate_detection_flag></payment_details><financials><taxes><municipal_tax>0</municipal_tax><state_tax>0</state_tax><county_tax>0</county_tax></taxes><originators_principal_amount>254455</originators_principal_amount><destination_principal_amount>199900</destination_principal_amount><gross_total_amount>257455</gross_total_amount><plus_charges_amount>0</plus_charges_amount><charges>3000</charges><message_charge>0</message_charge></financials><promotions><promo_code_description/><promo_message/><sender_promo_code/></promotions><mtcn>0352466394</mtcn><new_mtcn>2324380352466394</new_mtcn><foreign_remote_system><identifier>WGQCUS1250T</identifier><reference_no>Y3snz233UkGt1Gw4</reference_no><counter_id>US125QCUSD1T</counter_id></foreign_remote_system><filing_date>08-31</filing_date><filing_time>0135P
      EDT </filing_time><Is_convenience_search_flag/><Is_convenience_suppress_Flag/></xrsi:send-money-validation-reply></soapenv:Body></soapenv:Envelope>'
    content_type: text/plain
    method: POST
    status: 200
    url: https://wugateway2pi.westernunion.com/SendmoneyValidation_Service_H2H
- response:
    auto_calculate_content_length: false
    body: '<?xml version="1.0" encoding="UTF-8"?>

      <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
      xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><xrsi:send-money-store-reply
      xmlns:xrsi="http://www.westernunion.com/schema/xrsi"><instant_notification><addl_service_charges>010300002010030100103MSG02010030101103FEE1204300013043000961501010020100301099200101C0211UDI0000009299210417wufxspd0002046230</addl_service_charges></instant_notification><advisory_text>08/31/23
      13:35</advisory_text><sender><name name_type="C"><business_name>UNICEF</business_name></name><address><addr_line1>3
      United Nations Plaza</addr_line1><addr_line2/><city>NEW YORK</city><state>NY</state><postal_code>10017</postal_code><country_code><iso_code><country_code>US</country_code><currency_code>USD</currency_code></iso_code><country_name>US</country_name></country_code><local_area>NEW
      YORK</local_area><street>3 United Nations Plaza</street></address><preferred_customer/><email>unicef@unicef.org</email><contact_phone>2123267000</contact_phone><mobile_phone><phone_number><country_code>1</country_code><national_number>2123267000</national_number></phone_number></mobile_phone></sender><receiver><name
      name_type="D"><first_name>Aliyah</first_name><last_name>GRAY</last_name></name><address><country_code><iso_code><country_code>ES</country_code><currency_code>EUR</currency_code></iso_code></country_code></address><email>john@smith.com</email><mobile_phone><phone_number/></mobile_phone></receiver><payment_details><expected_payout_location/><recording_country_currency><iso_code><country_code>US</country_code><currency_code>USD</currency_code></iso_code></recording_country_currency><destination_country_currency><iso_code><country_code>ES</country_code><currency_code>EUR</currency_code></iso_code></destination_country_currency><originating_country_currency><iso_code><country_code>US</country_code><currency_code>USD</currency_code></iso_code></originating_country_currency><originating_city>NEW
      YORK</originating_city><originating_state>NE</originating_state><transaction_type>WMF</transaction_type><fix_on_send>Y</fix_on_send><credit_debit_card_details><authorization_code/></credit_debit_card_details></payment_details><financials><taxes><municipal_tax>0</municipal_tax><state_tax>0</state_tax><county_tax>0</county_tax></taxes><originators_principal_amount>254455</originators_principal_amount><destination_principal_amount>199900</destination_principal_amount><gross_total_amount>257455</gross_total_amount><plus_charges_amount>0</plus_charges_amount><charges>3000</charges><message_charge>0</message_charge></financials><promotions><promo_code_description/><promo_message/><sender_promo_code/></promotions><mtcn>0352466394</mtcn><new_mtcn>2324380352466394</new_mtcn><filing_date>08-31</filing_date><filing_time>0135P
      EDT </filing_time><pin_text_message_set_2/><pin_text_message_set_2/><pin_text_message_set_2/><promo_text_message>Don''t
      miss out on exclusive benefits available to MY WU loyalty</promo_text_message><promo_text_message>members!
      Not a member yet? Want to learn about available rewards?</promo_text_message><promo_text_message>Ready
      to redeem points? For all of this, visit www.wu.com/mywu.</promo_text_message><promo_text_message/><promo_text_message/><promo_text_message/><new_points_earned>0</new_points_earned><phone_pin>                    </phone_pin><phone_pin_text/><auto_enroll_text/><auto_enroll_text/><auto_enroll_text/><foreign_remote_system><identifier>WGQCUS1250T</identifier><reference_no>Y3snz233UkGt1Gw4</reference_no><counter_id>US125QCUSD1T</counter_id></foreign_remote_system><host_message_set3/><host_message_set3/><host_message_set3/><Is_convenience_search_flag>Y</Is_convenience_search_flag><Is_convenience_suppress_Flag>Y</Is_convenience_suppress_Flag></xrsi:send-money-store-reply></soapenv:Body></soapenv:Envelope>'
    content_type: text/plain
    method: POST
    status: 200
    url: https://wugateway2pi.westernunion.com/SendMoneyStore_Service_H2H
